package lesson12.homework;
//First level: Напишите функцию для сравнения двух сетов - boolean checkSets(Set s1, Set s2)
// - использовать любые операции кроме Set.equals()
//
//
//Second level: * Напишите в CustomArrayDeque итератор для перебора в обратном направлении
//
//
//
//Напишите в CustomArrayDeque итератор для перебора по убыванию значений элементов.
//
//
//Напишите  функцию, которая ищет самую длинную последовательность четных чисел
// (расположенных последовательно по порядку) в передаваемом в нее List и возвращает ее в виде Collection.
// Пример [1,2,5,6,8,7,4] -> [6,8]
public class Homework_12 {
}
