package algorithms.lesson7;

/*First level: 1. Повторить код из лекции урока по динамическому программированию,
        те три варианта подсчета числа фибоначчи. Замерить производительность для каждого варианта и вывести в консоль.



        Работа со стеком.
        Доделать получение минимального элемента из стека. Важно! Минимальный элемент
        должне быть всегда корректный, даже если вытащили несколько элементов из стека.


        Second level: 3.Напишите программу, которая реверсирует стек с помощью рекурсии.
        Вам не разрешено использовать конструкции цикла, такие как while, for.. и тд
        Вы можете использовать только следующие функции в стеке S:
        isEmpty(S)
        push(S)
        pop(S)*/
public class Homework {
}
