package algorithms.lesson6;
//First level: 1.Реализовать остальные методы динамического массива.
// Список методов приведен на предпоследнем слайде в презентации
// Презентация в группе.
//
//
//
//Напишите метод, который добавляет 1000000 элементов в ArrayList(можно попробовать использовать вместо ArrayList свой динамический массив) и LinkedList.
//Напишите еще один метод, который выбирает из заполненного списка элемент наугад 100000 раз. Замерьте время, которое потрачено на это. Сравните результаты и предположите, почему они именно такие.
//
//
//Second level: 2.Написать class DynamicArrayIterator для DynamicArray (сделать свой итератор для своего динамического массива.)
public class Homework {
    public static void main(String[] args) {

    }
}
